>>SOURCE FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. SEARCH.
AUTHOR. Jacob
DATE-WRITTEN. 09/18/2025

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT PROFILE-FILE ASSIGN TO 'profiles.txt'
        ORGANIZATION IS LINE SEQUENTIAL
        FILE STATUS IS WS-FILE-STATUS.


DATA DIVISION.

FILE SECTION.
FD PROFILE-FILE.
01 PROFILE-RECORD       PIC X(250).

WORKING-STORAGE SECTION.
01 WS-FILE-STATUS       PIC XX.
01 WS-EOF-FLAG          PIC X VALUE 'N'.
01 WS-MESSAGE           PIC X(80).
01 WS-TEMP-ONE          PIC X(80).
01 WS-CURRENT-FIRST     PIC X(50).
01 WS-CURRENT-LAST      PIC X(50).
LINKAGE SECTION.
01 LS-FIRST             PIC X(20).
01 LS-LAST              PIC X(20).
01 LS-PROFILE-DATA.
   05 LS-FIRST-NAME     PIC X(50).
   05 LS-LAST-NAME      PIC X(50).
   05 LS-UNIVERSITY     PIC X(100).
   05 LS-MAJOR          PIC X(50).
   05 LS-GRAD-YEAR      PIC X(4).
   05 LS-ABOUT-ME       PIC X(200).
   05 LS-EXPERIENCE-TABLE.
      10 LS-EXPERIENCE OCCURS 3 TIMES INDEXED BY EXP-IDX.
         15 LS-EXP-TITLE    PIC X(50).
         15 LS-EXP-COMPANY  PIC X(50).
         15 LS-EXP-DATES    PIC X(50).
         15 LS-EXP-DESC     PIC X(100).
   05 LS-EXP-COUNT      PIC 9.
   05 LS-EDUCATION-TABLE.
      10 LS-EDUCATION OCCURS 3 TIMES INDEXED BY EDU-IDX.
         15 LS-EDU-DEGREE   PIC X(50).
         15 LS-EDU-UNIV     PIC X(50).
         15 LS-EDU-YEARS    PIC X(50).
   05 LS-EDU-COUNT      PIC 9.

01 LS-RETURN-CODE       PIC X.
01 LS-RETURN-USER       PIC X(20).
PROCEDURE DIVISION USING LS-FIRST, LS-LAST, LS-PROFILE-DATA, LS-RETURN-CODE, LS-RETURN-USER.
    MOVE 'F' TO LS-RETURN-CODE
    MOVE 'N' TO WS-EOF-FLAG

    *> Trim input username and password to remove extra spaces or newlines
    MOVE FUNCTION TRIM(LS-FIRST) TO LS-FIRST
    MOVE FUNCTION TRIM(LS-LAST) TO LS-LAST

    OPEN INPUT PROFILE-FILE
    IF WS-FILE-STATUS NOT = "00"
       DISPLAY "Error opening profiles file."
       DISPLAY "File Status: " WS-FILE-STATUS
       MOVE 'X' TO LS-RETURN-CODE
       CLOSE PROFILE-FILE
       GOBACK
    END-IF

    PERFORM UNTIL WS-EOF-FLAG = 'Y'
       READ PROFILE-FILE
           AT END
               MOVE 'Y' TO WS-EOF-FLAG
           NOT AT END
               EVALUATE TRUE
                   WHEN PROFILE-RECORD(1:5) = "USER:"
                   MOVE PROFILE-RECORD(6:) TO WS-TEMP-ONE
                   WHEN PROFILE-RECORD(1:5) = "FNAM:"
                       MOVE PROFILE-RECORD(6:) TO WS-CURRENT-FIRST
                   WHEN PROFILE-RECORD(1:5) = "LNAM:"
                       MOVE PROFILE-RECORD(6:) TO WS-CURRENT-LAST
               END-EVALUATE

               IF WS-CURRENT-FIRST = LS-FIRST AND WS-CURRENT-LAST = LS-LAST
                   MOVE WS-TEMP-ONE TO LS-RETURN-USER
                   MOVE 'T' TO LS-RETURN-CODE
                   MOVE 'Y' TO WS-EOF-FLAG
               END-IF
       END-READ
    END-PERFORM
    CLOSE PROFILE-FILE
    GOBACK.
